// === Игра в Жизнь ===

// === Цель ===
// Написать легко конфигурируемый клтеочный автомат

// === ТЗ ===
/*
    * Использовать ООП. Обязательные классы:
        а) Game - содержит настройку мира / правила игры
        b) Cell - класс ячейки
        c) Field - класс игрового поля, содержит ячейки, реализует метод 
            по переходу к следующему шагу игры

    * Настройка мира / Правила игру содержатся в классе Game и их можно менять

    * Игровое поле отображается в терминале, но можно и UI

    * Использовать пройденные на лекциях материалы

    * (доп на 9-10) Чтобы для изменения настроек мира не перекомпилировать код,
        заставить класс Game читать настройки из файла конфигурации, YAML / JSON
*/

